{
  "resourceType": "CodeSystem",
  "id": "BreastRadUSMassPosteriorAcousticFeaturesCS",
  "extension": [
    {
      "url": "http://www.fragment.com/fragment",
      "valueUrl": "http://hl7.org/fhir/us/breast-radiology/StructureDefinition/HeaderFragment"
    }
  ],
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/BreastRadUSMassPosteriorAcousticFeaturesCS",
  "name": "BreastRadUSMassPosteriorAcousticFeaturesCS",
  "title": "Breast Radiology Ultra-Sound Mass Posterior Acoustic Features",
  "description": "Breast Radiology Ultra-Sound Mass Posterior Acoustic Features",
  "caseSensitive": true,
  "content": "complete",
  "count": 4,
  "concept": [
    {
      "code": "NoPosteriorAcousticFeatures",
      "display": "No Posterior Acoustic Features",
      "definition": "No shadowing or enhancement is present deep to the mass; the echogenicity of the area immediately behind the mass is not different from that of adjacent tissue at the same depth."
    },
    {
      "code": "Enhancement",
      "display": "Enhancement",
      "definition": "Sound transmission is unimpeded in its passage through the mass. Enhancement appears as a column that is more echogenic (whiter) deep to the mass. One criterion for cyst diagnosis is enhancement. Homogeneous solid lesions, including high-grade carcinomas, may also show enhancement."
    },
    {
      "code": "Shadowing",
      "display": "Shadowing",
      "definition": "Shadowing is attenuation of the acoustic transmission. Sonographically, the area posterior to the mass appears darker. At the edges of curved masses, acoustic velocity changes and thin shadows are seen. This refractive edge shadowing is of no significance and should be distinguished from central shadowing, which is a property of the mass.Shadowing is associated with fibrosis, with or without an underlying carcinoma. Postsurgical scars, fibrous mastopathy and many cancers with or without a desmoplastic response will show posterior acoustic shadowing. Macrocalcifications can also attenuate sound. Similar to a vertical (taller-than-wide) orientation, shadowing is a feature more helpful when present than when absent. Many cancers will exhibit enhancement or no change in posterior features, particularly those that are high grade."
    },
    {
      "code": "CombinedPattern",
      "display": "Combined Pattern",
      "definition": "Some lesions have more than one pattern of posterior attenuation. For example, a fibroadenoma containing a large calcification may demonstrate shadowing posterior to the calcified area but enhancement of the tissues deep to the uncalcified portion. A combined pattern of posterior features also may be seen in lesions that are evolving. One such example is a post-lumpectomy seroma, which enhances posteriorly. As the fluid is resorbed and scarring develops, the features of fibrosis become evident as spiculation of the margins and posterior acoustic shadowing."
    }
  ]
}