{
  "resourceType": "CodeSystem",
  "id": "BreastRadUSMassEchoPatternCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/BreastRadUSMassEchoPatternCS",
  "version": "0.0.2",
  "name": "BreastRadUSMassEchoPatternCS",
  "title": "Breast Radiology Ultra-Sound Mass Echo Pattern",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Breast Radiology Ultra-Sound Mass Echo Pattern",
  "caseSensitive": true,
  "content": "complete",
  "count": 6,
  "concept": [
    {
      "code": "Anechoic",
      "display": "Anechoic",
      "definition": "Without internal echoes."
    },
    {
      "code": "Hyperechoic",
      "display": "Hyperechoic",
      "definition": "Hyperechogenicity is defined as having increased echogenicity relative to fat or equal to fibroglandular tissue."
    },
    {
      "code": "ComplexCysticAndSolid",
      "display": "Complex Cystic and Solid",
      "definition": "A complex mass contains both anechoic (cystic or fluid) and echogenic (solid) components."
    },
    {
      "code": "Hypoechoic",
      "display": "Hypoechoic",
      "definition": "The term “hypoechoic” is defined relative to subcutaneous fat; hypoechoic masses, less echogenic than fat, are characterized by low-level echoes throughout (for example, complicated cysts and fibroadenomas)"
    },
    {
      "code": "Isoechoic",
      "display": "Isoechoic",
      "definition": "Isoechogenicity is defined as having the same echogenicity as subcutaneous fat. Isoechoic masses may be relatively inconspicuous, particularly when they are situated within an area of fat lobules. This may limit the sensitivity of US, especially at screening, in which the presence and location of such a mass is not known at the time of examination."
    },
    {
      "code": "Heterogeneous",
      "display": "Heterogeneous",
      "definition": "A mixture of echogenic patterns within a solid mass. Heterogeneity has little prognostic value in differentiating benign from malignant masses, but it is not uncommon to observe heterogeneity in fibroadenomas as well as cancers. Clumped areas of different echogenicity may elevate the suspicion for malignancy, particularly in a mass whose margins are not circumscribed and whose shape is irregular."
    }
  ]
}