{
  "resourceType": "CodeSystem",
  "id": "BreastRadUSTissueCompositionCS",
  "url": "http://hl7.org/fhir/us/breast-radiology/CodeSystem/BreastRadUSTissueCompositionCS",
  "version": "0.0.2",
  "name": "BreastRadUSTissueCompositionCS",
  "title": "Breast Radiology Ultra-Sound Tissue Composition Observation",
  "status": "draft",
  "date": "2019-11-01",
  "publisher": "Hl7-Clinical Interoperability Council",
  "contact": [
    {
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/cic"
        }
      ]
    }
  ],
  "description": "Breast Radiology Ultra-Sound Tissue Composition Observation\n\n\n### BI-RADS® ATLAS — MAMMOGRAPHY### FIFTH EDITION — 2013The wide normal variability in tissue composition seen on mammograms can also be observed\non US images. Just as increasing breast density diminishes the sensitivity of mammography in the\ndetection of small masses, heterogeneous background echotexture of the breast may affect the\nsensitivity of breast sonograms for lesion detection.\n### END BI-RADS® ATLAS — MAMMOGRAPHY TEXT",
  "caseSensitive": true,
  "content": "complete",
  "count": 3,
  "concept": [
    {
      "code": "Fat",
      "display": "Homogenous Background Echotexture - Fat",
      "definition": "Fat lobules and uniformly echogenic bands of supporting structures (Cooper’s ligaments [arrows]) comprise the bulk of breast tissue."
    },
    {
      "code": "Fibroglandular",
      "display": "Homogenous Background Echotexture - Fibroglandular",
      "definition": "A thick zone of homogeneously echogenic fibroglandular parenchyma is present beneath the thin hypoechoic layer of fat lobules. Many lesions, cancers and fibroadenomas, for example, are found within the fibroglandular zone or at its junction with the layer of fat."
    },
    {
      "code": "Heterogeneous",
      "display": "Heterogeneous Background Echo Texture",
      "definition": "Heterogeneity can be either focal or diffuse. The breast echotexture is characterized by multiple small areas of increased and decreased echogenicity. Shadowing may occur at the interfaces of fat lobules and parenchyma. This pattern occurs in younger breasts and those with heterogeneously dense parenchyma depicted mammographically. Whether and how this pattern affects the sensitivity of sonography merits study, but technical maneuvers may help resolve interpretive dilemmas that occasionally result in unnecessary biopsy."
    }
  ]
}